#                    Синтаксис
#В первую очередь:

#операции с целыми и вещественными числами;
#типы данных;
#переменные, ветвления, стандартный ввод/вывод;
#логические операции, операции сравнения;
#условия: if, else, elif;
#блоки, отступы;
#строки и символы;
#циклы while, for;
#операторы break, continue;
#установка и подключение модулей;
#списки;
#функции;
#словари;
#интерпретатор: установка, запуск скрипта;
#файловый ввод/вывод.
#                     Git
#                     ...
# ПОСТОЯНСТВО НЕВЕРОЯТНО ВАЖНО: КАЖДЫЙ ДЕНЬ ПО ЧАСУ ИЛИ ЧЕРЕЗ ДЕНЬ ПО 1-2 ЧАСА
# САМОЕ ГЛАВНОЕ ЭТО ПРАКТИКА. ЗАДАЧИ
# ООП
# Request
# Django
# Kivi
# Tkinter
https://stepik.org/course/67/ — бесплатный курс для начинающих от института биоинформатики


https://www.codewars.com/r/XnnqMQ — задачи для программистов, мой любимый сайт


https://py.checkio.org/ — еще один английский сайт с задачами
https://pythontutor.ru/ — задачи на русском, но описание условий в них оставляет желать лучшего...


https://m.habr.com/en/company/JetBrai... — продвинутый курс от Computer Science Center