# Indexing:
"""
Індекси можуть створюватися для таблиць відповідно до однієї або
кілької колонок

Зазвичай для пошуку елементу у таблиці по колонці, субд проходитиметься
по всім елементам підряд поки не відбере елементи у відповідності до фільтру

У майскл це називається первинний індекс або кластерний індекс
За винятком фільтру по пк. В такому разі субд шукатиме елемент по алгоритму
бінарного пошуку в основній таблиці.
Це якщо пк є автоінкрементним і відсортованим

У постгрес нема первинних індексів

Щоб шукати так само і по іншому не пк полю тоді треба зробити по ньому індекс

Індекс має назву і по суті це ВІДСОРТОВАНА структура данних яка створюється
поряд з основною таблицею та у якій зберігаються відповідності:


employee_id | first_name | last_name | department_id
----------------------------------------------------
1           | John       | Doe       | 101
2           | Jane       | Smith     | 102
3           | Alice      | Johnson   | 101
4           | Bob        | Brown     | 103
5           | Emily      | Davis     | 102


If you create an index on the department_id column, the index data
structure might look something like this:

department_id | employee_ids
----------------------------
101           | 1, 3
102           | 2, 5
103           | 4

Now, if we create a composite index on (department_id, last_name),
the index might look like this:

department_id | last_name | employee_ids
----------------------------------------
101           | Doe       | 1
101           | Johnson   | 3
102           | Davis     | 5
102           | Smith     | 2
103           | Brown     | 4

Отже індекс це структура данних яка бере унікальні значення у колонці або
декількох колонках і сортує їх для того щоб можна було знайти значення
алгоритмом бінарного пошуку. І кожне унікальне значення колонки зберігає
посилання на колекцію айдішників в основній таблиці

Якщо індекс по 1+ колонкам тоді просто відбувається сортування по 1+ колонкам

Отже індекс сильно прискорює селект
Але при кожному інсерті або аптейті(якщо аптейтеться проіндексоване поле)
Індекс оновлюється а це в свою чергу заповільнює аптейт та інсерт

Також індекс не працюватиме із запитом "%search text%" бо в такому разі
сортування не має значення і алгоритм бінарного пошуку нічим не допоможе
Для цього випадку треба створювати інвертований індекс.
По суті так працює еластік

Індекси є кластерезовані та не кластерезовані
В МайСКЛ кластерезований індекс створюється по дефолту на ПК колонку так як
вона є унікальною, не нуловою та відсортованою.

А не кластирезований це той що створюється окремо додатково

"""