"""

cd new_catalog - перейти из текущего каталога в new_catalog если он лежит непосредственно в текущем каталоге

Можно указать полный путь и перейти в любой каталог по полному пути cd C:\Users\Семья

cd.. - переход на один каталог вверх

X: - перейти в диск Х

md new_catalog - создать new_catalog в текущем каталоге

md D:\new_catalog\new_new_catalog - создание каталога с ипользованием абсолютного имени. Создастся и каталог и
подкаталог если они не сущевствовали

move folder1 folder2 - переименовать папку с именем folder1 в folder2 в текущем каталоге.

dir - проверяет содержимое текущей папки

cls - Очищает командную строку

echo.> new_file - эта команда именно в таком виде создает новый файл new_file с разширением или нет

Команды можно вводить как заглавными, так и строчными буквами.

"""