"""

1. Возможность работать с несколькими файлами одновременно. ПКМ на файл и выбрать его расположение
2. Ctrl + alt + l выравнивание отступов
3. Alt + enter варианты откуда автоматически импортировать указанный клас или модуль
4. Два нажатия шифта вызывает умный поиск
5. Выделенный текст можно быстро занести в кавычки если указана эта настройка в settings + editor + general + smart keys
+ surround selection on typing quote or brace
6. Shift + f6 на выделенной переменной дает возможность переименовать эту переменную во всех местах где она используется
7. Ctrl + выделенный класс или метод переместит нас в то место где этот клас или метод описан
8. Для удобного подключения и работы с базой данных можно установить плагин DataBase Navigator в Settings + Editor +
Plugins + Marketplace
"""

