"""
	Как работает интернет - YouTube
	Как работает Интернет? - YouTube
	Как работает интернет? Протоколы HTTP/HTTPS, FTP. Хостинг. Для самых маленьких. - YouTube
	Как устроен интернет - YouTube

	Как стать программистом с нуля? Советы и мотивация от специалиста с 15-летним опытом - YouTube
	Критично важные качества для профессионального успеха - YouTube
	Что должен знать Python веб-разработчик для приёма на работу? - YouTube

	Pycharm уроки - YouTube  - Настройка рабочего места

	Моя самая любимая программа. ТОП-1. Evernote! - YouTube
	Про базовый фундамент в разработке веб-приложений - YouTube
	MVC - Суть шаблона на примерах - YouTube
	Паттерн MVC и его реализация в Django // Бесплатный урок OTUS - YouTube
	Архитектура ПО, MVC и бизнес-логика. Критика Django - YouTube
	Бизнес-логика в Django и архитектура Django проектов — на настоящем примере - YouTube
	Именование переменных, классов и методов в коде - YouTube
	Исправьте СРОЧНО эти 12 ошибок в ваших Python проектах - YouTube
	Принцип EAFP в Python, работа с исключениями в Python. Применение принципов Zen of Python - YouTube
	Ты неправильно замеряешь время в Python! Или нет? - YouTube

Git. Большой практический выпуск - YouTube
Git уроки - YouTube
Базовый курс по Git - YouTube

Поднимаем Debian сервер для Python/Django — установка и настройка с нуля. Как настроить сервер? - YouTube
Apache против Nginx. Apache есть место в 2019м? Сравнение двух лидирующих HTTP серверов - YouTube
Nginx без downtime на продакшн системе / Nginx hot reload - YouTube
Как получить и настроить LetsEncrypt SSL сертификат для сайта? - YouTube
Настраиваем авторизацию SSH по ключу в Linux / Unix - YouTube

Графика для веба, которую все используют неправильно. Про JPG/PNG, WebP и SVG, а также мощь HTML5 - YouTube
Как хранить пароли и ключи в коде проектов? Всё о переменных окружения. Пример с Django - YouTube
jQuery и современный JavaScript/CSS, пара слов о развитии фронтенда - YouTube

Всё об исключениях и работе с ними в Python - YouTube
Асинхронность в McDonalds и Python - YouTube
🚀Собираем масштабируемую архитектуру веб-приложения. Горизонтальное и вертикальное масштабирование - YouTube

Эффективно работаем со сложными структурами данных в Python 3.7+ - YouTube
Пишем Telegram бот для учёта расходов с Python, Asyncio/Aiogram, SQLite и Docker - YouTube
Ищем ботов в Instagram подписчиках на Python - YouTube

#1. Читаем исходники open source Python библиотек. Loguru! - YouTube
Стрим с Code Review вашего Python кода - YouTube
Стрим с Code Review вашего Python кода # 2 - YouTube

Почему тебе нужен PgBouncer, как его установить? Оптимизируем веб-приложения с PostgreSQL - YouTube
Обработка и отслеживание ошибок и исключений в Django - YouTube
Логирование в Python и Django - YouTube
Django Middleware — что это, зачем и как использовать - YouTube
Многопроцессность, многопоточность, асинхронность в Python и не только. Что это и как работает? - YouTube
Асинхронный Python-код медленнее обычного кода! Ааа!!1один. Aiohttp VS синхронные фреймворки - YouTube
Pydantic — умопомрачительная валидация данных на Python! JSON + Pydantic = ❤️ - YouTube

С чего начать IT проект? Как работать с большими проектами — этапы, важные аспекты, советы - YouTube
Tmux — что это и зачем? Обзор и урок tmux - YouTube
Запуск среды разработки в tmux - YouTube
Tmux буферы, скролинг и копирование текста - YouTube
Htop — менеджер процессов Linux / Unix / Mac OS X - YouTube
🔥Разбираем SQL на примере PostgreSQL — SELECT, JOIN, GROUP, HAVING, Coalesce и др. - YouTube

Advanced:


- FastAPI Channel - YouTube
Уроки FastAPI - YouTube
Разработка проекта "Useful" - YouTube
Pet-project Anti-TikTok - FastAPI - YouTube

- Docker
Основы Docker. Большой практический выпуск - YouTube
Docker уроки от А до Я - YouTube
Django + Docker - YouTube
"""